{
    "audio": {
        "audio_files": [
            {
                "id": 1129,
                "chapter_id": 110,
                "file_size": 569472.0,
                "format": "mp3",
                "audio_url": "https://download.quranicaudio.com/qdc/mishari_al_afasy/murattal/110.mp3",
                "duration": 25000,
                "verse_timings": [
                    {
                        "verse_key": "110:1",
                        "timestamp_from": 0,
                        "timestamp_to": 6920,
                        "duration": 6920,
                        "segments": [
                            [
                                1,
                                0,
                                720
                            ],
                            [
                                2,
                                720,
                                3630
                            ],
                            [
                                3,
                                3630,
                                4190
                            ],
                            [
                                4,
                                4190,
                                5170
                            ],
                            [
                                5,
                                5170,
                                6795
                            ]
                        ]
                    },
                    {
                        "verse_key": "110:2",
                        "timestamp_from": 6920,
                        "timestamp_to": 15100,
                        "duration": 8180,
                        "segments": [
                            [
                                1,
                                6795,
                                7825
                            ],
                            [
                                2,
                                7825,
                                9515
                            ],
                            [
                                3,
                                9515,
                                10725
                            ],
                            [
                                4,
                                10725,
                                11195
                            ],
                            [
                                5,
                                11195,
                                12135
                            ],
                            [
                                6,
                                12135,
                                12765
                            ],
                            [
                                7,
                                12765,
                                14280
                            ]
                        ]
                    },
                    {
                        "verse_key": "110:3",
                        "timestamp_from": 15100,
                        "timestamp_to": 25160,
                        "duration": 10060,
                        "segments": [
                            [
                                1,
                                14405,
                                15455
                            ],
                            [
                                2,
                                15455,
                                16255
                            ],
                            [
                                3,
                                16255,
                                17255
                            ],
                            [
                                4,
                                17255,
                                19015
                            ],
                            [
                                5,
                                19015,
                                20795
                            ],
                            [
                                6,
                                20795,
                                21545
                            ],
                            [
                                7,
                                21545,
                                23190
                            ]
                        ]
                    }
                ]
            }
        ]
    },
    "surah_info": {
        "surah_name": "Surah An-Nasr",
        "ayah_count": "3",
        "revelation_place": "Medina",
        "description": "Name\nThe Surah takes its name from the word nasr occurring in the first verse.\nPeriod of Revelation\nHadrat Abdullah bin Abbas states that this is the last Surah of the Quran to be revealed, i. e. no complete Surah was sent down to the Holy Prophet after it. (Muslim Nasai, Tabarani, Ibn Abi Shaibah, Ibn Marduyah).\nAccording to Hadrat Abdullah bin Umar, this Surah was sent down on the occasion of the Farewell Pilgrimage in the middle of the Tashriq Days at Mina, and after it the Holy Prophet rode his she camel and gave his well known Sermon. (Tirmidhi, Bazzar, Baihaqi, Ibn Abi Shaibah, Abd bin Humaid, Abn Yala, Ibn Marduyah). Baihaqi in Kitab al- Hajj has related from the tradition of Hadrat Sarra bint-Nabhan the Sermon which the Holy Prophet gave on this occasion. She says:\n\"At the Farewell Pilgrimage I heard the Holy Prophet say: O people, do you know what day it is? They said: Allah and His Messenger have the best knowledge. He said: This is the middle day of the Tashriq Days. Then he said: Do you know what place it is? They said: Allah and His Messenger have the best knowledge. He said: This is Masharil-Haram. Then he said: I do not know, I might not meet you here again. Beware, your bloods and your honors are forbidden, until you appear before your Lord, and He questions you about your deeds. Listen: let the one who is near convey it to him who is far away. Listen: have I conveyed the message to you? Then, when we returned to Madinah, the Holy Prophet passed away not many days after that.\"\nIf both these traditions are read together, it appears that there was an interval of three months and some days between the revelation of Surah An-Nasr and the Holy Prophet's death, for historically the same was the interval between the Farewell Pilgrimage and the passing away of the Holy Prophet.\nIbn Abbas says that when this Surah was revealed, the Holy Prophet said that he had been informed of his death and his time had approached. (Musnad Ahmad, Ibn Jarir, Ibn al-Mundhir, Ibn Marduyah). In the other traditions related from Hadrat Abdullah bin Abbas, it has been stated that at the revelation of this Surah the Holy Prophet understood that he had been informed of his departure from the world.(Musnad Ahmad, Ibn Jarir, Tabarani, Nasai, Ibn Abi Hatim, Ibn Marduyah).\nMother of the Believers, Hadrat Umm Habibah, says that when this Surah was revealed the Holy Prophet said that he would leave the world that year. Hearing this Hadrat Fatimah wept. Thereat he said: \"From among my family you will be the first to join me.\" Hearing this she laughed.(Ibn Abi Hatim, Ibn Marduyah). A tradition containing almost the same theme has been related by Baihaqi from Ibn Abbas.\nIbn Abbas says: \"Hadrat Umar used to invite me to sit in his assembly along with some of the important elderly Companions who had fought at Badr. This was not liked by some of them. They complained that they also had sons who were like the boy. Why then was he in particular invited to sit in the assembly? (Imam Bukhari and Ibn Jarir have pointed out that such a thing was said by Hadrat Abdur Rahman bin Auf).\nHadrat Umar said that the boy enjoyed the position and distinction because of his knowledge. Then one day he invited the Companions of Badr and called me also to sit with them. I understood that he had invited me to the assembly to prove his contention. During the conversation Hadrat Umar asked the Companions of Badr: \"What do you say about Idha jaa nasrullahi wal- fath?\" Some said: \"In it we have been enjoined to praise Allah and ask for His forgiveness when His succor comes and we attain victory.\"Some others said that it implied the conquest of cities and forts. Some kept quiet. Then Hadrat Umar said: \"Ibn Abbas, do you also say the same?\"I said no. He asked: \"What then is your view?\"I submitted that it implied the last hour of Allah's Messenger (upon whom be peace); in it he was informed that when Allah's succor came and victory was attained, it would be a sign that his hour had come; therefore, he should praise Allah and ask for His forgiveness. Thereat Hadrat Umar\r\nsaid \"I know naught but what you have said.\"\nIn another tradition there is the addition that, Hadrat Umar said to the Companions: \"How can you blame me when you yourselves have seen why I invite this boy to join the assembly?\" (Bukhari, Musnad Ahmad, Tirmidhi, Ibn Jarir, Ibn Marduyah, Baghawi, Baihaqi, Ibn al-Mundhir).\nTheme and Subject Matter\nAs is shown by the above traditions, Allah in this Surah had informed His Messenger (upon whom be peace) that when Islam attained complete victory in Arabia and the people started entering Allah's religion in great numbers, it would mean that the mission for which he had been sent to the world, had been fulfilled. Then, he was enjoined to busy himself in praising and glorifying Allah by Whose bounty he had been able to accomplish such a great task, and should implore Him to forgive whatever failings and frailties he might have shown in the performance of the service. Here, by a little consideration one can easily see the great difference that there is between a Prophet and a common worldly leader. If a worldly leader in his own lifetime is able to bring about a revolution, which has the aim and objective of his struggle, this would be an occasion for exultation for him. But here we witness quite another phenomenon. The Messenger of Allah in a brief space of 23 years\r\nrevolutionized an entire nation as regards its beliefs, thoughts, customs, morals, civilization, ways of living, economy, politics and fighting ability, and raising it from ignorance and barbarism enabled it to conquer the world and become leader of nations; yet when he had accomplished this unique task, he was not enjoined to celebrate it but to glorify and praise Allah and to pray for His forgiveness, and he busied himself humbly the implementation of that command.\nHadrat Aishah says: \"The Holy Messenger (upon whom be peace) often used to recite Subhanak-Allahumma wa bi-hamdika astaghfiruka wa atubu ilaika (according to some other traditions, Subhan Allahi wa bi hamdi-hi as- taghfirullaha wa atubu ilaihi) before his death. I asked: O Messenger of Allah, what are these words that you have started reciting now? He replied: A sign has been appointed for me so that when I see it, I should recite these words, and it is: Idha jaa nasrullahi wal-fathu.\" (Musnad Ahmad, Muslim, Ibn Jarir, lbn al-Mundhir, Ibn Marduyah).\nIn some other traditions on the same subject Hadrat Aishah has reported that the Holy Prophet often recited the following words in his ruku and sajdah: Subhanak-Allahumma wa-bi hamdika, Allahumma- aghfirli. This was the interpretation of the Quran (i. e. of Surah An-Nasr) that he had made.(Bukhari, Muslim Abu Daud, Nasai, Ibn Majah, Ibn Jarir).\nHadrat Umm Salamah says that the Holy Prophet (upon whom be peace) during his last days very often recited the following words sitting and standing, going out of the house and coming back to it: Subhan Allahi wa-bi hamdi-hi. I one day asked: \"Why do you recite these words so often? O Messenger of Allah\". He replied: I have been enjoined to do so. Then he recited this Surah.\" (Ibn Jarir).\nAccording to Hadrat Abdullah bin Masud, when this Surah was revealed, the Messenger of Allah (upon whom be peace) frequently began to recite the words Subhanak-Allahumma wa bi-hamdika, Allahumm-aghfirli, subhanaka Rabbana wa bi-hamdika, Allahumm-aghfirli, innaka anta at- Tawwab al-Ghafur.(Ibn Jarir, Musnad Ahmad, Ibn Abi Hatim).\nIbn Abbas has stated that after the revelation of this Surah the Holy Messenger (upon whom be peace) began to labor so intensively and devotedly hard for the Hereafter as he had never done before."
    },
    "surah_verses": [
        {
            "verse_key": "110:1",
            "verse_num": "110:1",
            "arabic_text": " إِذَا جَآءَ نَصْرُ ٱللَّهِ وَٱلْفَتْحُ",
            "en_text": "When Allah’s ˹ultimate˺ help comes and the victory ˹over Mecca is achieved˺,"
        },
        {
            "verse_key": "110:2",
            "verse_num": "110:2",
            "arabic_text": "وَرَأَيْتَ ٱلنَّاسَ يَدْخُلُونَ فِى دِينِ ٱللَّهِ أَفْوَاجًا",
            "en_text": "and you ˹O Prophet˺ see the people embracing Allah’s Way in crowds,"
        },
        {
            "verse_key": "110:3",
            "verse_num": "110:3",
            "arabic_text": "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَٱسْتَغْفِرْهُ ۚ إِنَّهُۥ كَانَ تَوَّابًۢا",
            "en_text": "then glorify the praises of your Lord and seek His forgiveness, for certainly He is ever Accepting of Repentance."
        }
    ]
}