{
    "audio": {
        "audio_files": [
            {
                "id": 1095,
                "chapter_id": 93,
                "file_size": 1050752.0,
                "format": "mp3",
                "audio_url": "https://download.quranicaudio.com/qdc/mishari_al_afasy/murattal/93.mp3",
                "duration": 54000,
                "verse_timings": [
                    {
                        "verse_key": "93:1",
                        "timestamp_from": 0,
                        "timestamp_to": 1850,
                        "duration": 1860,
                        "segments": [
                            [
                                1,
                                0,
                                1275
                            ]
                        ]
                    },
                    {
                        "verse_key": "93:2",
                        "timestamp_from": 1850,
                        "timestamp_to": 4880,
                        "duration": 3030,
                        "segments": [
                            [
                                1,
                                1265,
                                2355
                            ],
                            [
                                2,
                                2355,
                                2945
                            ],
                            [
                                3,
                                2945,
                                3810
                            ]
                        ]
                    },
                    {
                        "verse_key": "93:3",
                        "timestamp_from": 4880,
                        "timestamp_to": 9290,
                        "duration": 4420,
                        "segments": [
                            [
                                1,
                                4395,
                                4885
                            ],
                            [
                                2,
                                4885,
                                6045
                            ],
                            [
                                3,
                                6045,
                                6915
                            ],
                            [
                                4,
                                6915,
                                7445
                            ],
                            [
                                5,
                                7445,
                                8300
                            ]
                        ]
                    },
                    {
                        "verse_key": "93:4",
                        "timestamp_from": 9290,
                        "timestamp_to": 14460,
                        "duration": 5170,
                        "segments": [
                            [
                                1,
                                8775,
                                10545
                            ],
                            [
                                2,
                                10545,
                                11325
                            ],
                            [
                                3,
                                11325,
                                11865
                            ],
                            [
                                4,
                                11865,
                                12255
                            ],
                            [
                                5,
                                12255,
                                13490
                            ]
                        ]
                    },
                    {
                        "verse_key": "93:5",
                        "timestamp_from": 14460,
                        "timestamp_to": 19480,
                        "duration": 5020,
                        "segments": [
                            [
                                1,
                                14005,
                                15145
                            ],
                            [
                                2,
                                15145,
                                16275
                            ],
                            [
                                3,
                                16275,
                                17175
                            ],
                            [
                                4,
                                17175,
                                18480
                            ]
                        ]
                    },
                    {
                        "verse_key": "93:6",
                        "timestamp_from": 19480,
                        "timestamp_to": 24700,
                        "duration": 5230,
                        "segments": [
                            [
                                1,
                                18935,
                                19575
                            ],
                            [
                                2,
                                19575,
                                20415
                            ],
                            [
                                3,
                                20415,
                                22365
                            ],
                            [
                                4,
                                22365,
                                23620
                            ]
                        ]
                    },
                    {
                        "verse_key": "93:7",
                        "timestamp_from": 24700,
                        "timestamp_to": 31810,
                        "duration": 7110,
                        "segments": [
                            [
                                1,
                                24155,
                                25285
                            ],
                            [
                                2,
                                25285,
                                29654
                            ],
                            [
                                3,
                                29655,
                                30770
                            ]
                        ]
                    },
                    {
                        "verse_key": "93:8",
                        "timestamp_from": 31810,
                        "timestamp_to": 37920,
                        "duration": 6110,
                        "segments": [
                            [
                                1,
                                31315,
                                32435
                            ],
                            [
                                2,
                                32435,
                                35525
                            ],
                            [
                                3,
                                35525,
                                36750
                            ]
                        ]
                    },
                    {
                        "verse_key": "93:9",
                        "timestamp_from": 37920,
                        "timestamp_to": 42830,
                        "duration": 4910,
                        "segments": [
                            [
                                1,
                                37245,
                                38885
                            ],
                            [
                                2,
                                38885,
                                39945
                            ],
                            [
                                3,
                                39945,
                                40695
                            ],
                            [
                                4,
                                40695,
                                42080
                            ]
                        ]
                    },
                    {
                        "verse_key": "93:10",
                        "timestamp_from": 42830,
                        "timestamp_to": 49070,
                        "duration": 6240,
                        "segments": [
                            [
                                1,
                                42755,
                                44095
                            ],
                            [
                                2,
                                44095,
                                47025
                            ],
                            [
                                3,
                                47025,
                                47625
                            ],
                            [
                                4,
                                47625,
                                48940
                            ]
                        ]
                    },
                    {
                        "verse_key": "93:11",
                        "timestamp_from": 49070,
                        "timestamp_to": 54950,
                        "duration": 5880,
                        "segments": [
                            [
                                1,
                                49015,
                                50775
                            ],
                            [
                                2,
                                50775,
                                51865
                            ],
                            [
                                3,
                                51865,
                                52795
                            ],
                            [
                                4,
                                52795,
                                54080
                            ]
                        ]
                    }
                ]
            }
        ]
    },
    "surah_info": {
        "surah_name": "Surah Ad-Duhaa",
        "ayah_count": "11",
        "revelation_place": "Mecca",
        "description": "Name\nThe Surah takes its name Ad-Duha from the very first word.\nPeriod of Revelation\nIts subject matter clearly indicates that it belongs to the earliest period at Makkah. Traditions also show that the revelations were suspended for a time, which caused the Holy Prophet (upon whom be Allah's peace) to be deeply distressed and grieved. On this account he felt very anxious that perhaps he had committed some error because of which his Lord had become angry with him and had forsaken him. Thereupon he was given the consolation that revelation had not been stopped because of some displeasure but this was necessitated by the same expediency as underlies the peace and stillness of the night after the bright day, as if to say: \"If you had continuously been exposed to the intensely bright light of Revelation (Wahi) your nerves could not have endured it. Therefore, an interval was given in order to afford you peace and tranquility.\" This state was experienced by the Holy Prophet in the initial stage of the Prophethood when he was not yet accustomed to hear the\r\nintensity of Revelation. On this basis, observance of a pause in between was necessary. This we have already explained in the introduction to Surah Al Muddaththir; and in E. N. 5 of Surah Al-Muzzammil also we have explained what great burden of the coming down of Revelation he had to bear. Later, when the Holy Prophet developed the power to bear this burden, there was no longer any need for long gaps.\nTheme and Subject Matter\nIts theme is to console the Holy Prophet (upon whom be peace) and its object to remove his anxiety and distress, which he had been caused by the suspension of Revelation. First of all, swearing an oath by the bright morning and the stillness of night, he has been reassured, so as to say: \"Your Lord has not at all forsaken you, nor is he displeased with you.\" Then, he has been given the good news that the hardships that he was experiencing in the initial stage of his mission, would not last long, for every later period of life for him would be better than the former period, and before long Allah would bless him so abundantly that he would be well pleased. This is one of the express prophecies of the Quran, which proved literally true, afterwards, whereas when this prophecy was made there seemed not to be the remotest chance that the helpless and powerless man who had come out to wage a war against the ignorance and paganism of the entire nation, would ever achieve such wonderful\r\nsuccess.\nThen, addressing His Holy Prophet (upon whom be peace) Allah says:\"O My dear Prophet, what has caused you the anxiety and distress that your Lord has forsaken you, and that We are displeased with you? Whereas the fact is that We have been good to you with kindness after kindness ever since the day of your birth. You were born an orphan, We made the best arrangement for your upbringing and care: you were unaware of the Way, We showed you the Way; you were indigent, We made you rich. All this shows that you have been favored by Us from the very beginning and Our grace and bounty has been constantly focused on you.\"Here, one should also keep in view vv. 37-42 of Surah Ta Ha, where Allah, while sending the Prophet Moses to confront a tyrant like Pharaoh, encouraged and consoled him, saying: \"We have been looking after you with kindness ever since your birth; therefore, you should be satisfied that you will not be left alone in this dreadful mission. Our bounty will constantly be\r\nwith you.\"\nIn conclusion, Allah has instructed His Prophet (upon whom be peace) telling him how he should treat the creatures of God to repay for the favors He has done him and how he should render thanks for the blessings He has bestowed on him."
    },
    "surah_verses": [
        {
            "verse_key": "93:1",
            "verse_num": "93:1",
            "arabic_text": " وَٱلضُّحَىٰ",
            "en_text": "By the morning sunlight,"
        },
        {
            "verse_key": "93:2",
            "verse_num": "93:2",
            "arabic_text": "وَٱلَّيْلِ إِذَا سَجَىٰ",
            "en_text": "and the night when it falls still!"
        },
        {
            "verse_key": "93:3",
            "verse_num": "93:3",
            "arabic_text": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ",
            "en_text": "Your Lord ˹O Prophet˺ has not abandoned you, nor has He become hateful ˹of you˺."
        },
        {
            "verse_key": "93:4",
            "verse_num": "93:4",
            "arabic_text": "وَلَلْـَٔاخِرَةُ خَيْرٌ لَّكَ مِنَ ٱلْأُولَىٰ",
            "en_text": "And the next life is certainly far better for you than this one."
        },
        {
            "verse_key": "93:5",
            "verse_num": "93:5",
            "arabic_text": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰٓ",
            "en_text": "And ˹surely˺ your Lord will give so much to you that you will be pleased."
        },
        {
            "verse_key": "93:6",
            "verse_num": "93:6",
            "arabic_text": "أَلَمْ يَجِدْكَ يَتِيمًا فَـَٔاوَىٰ",
            "en_text": "Did He not find you as an orphan then sheltered you?"
        },
        {
            "verse_key": "93:7",
            "verse_num": "93:7",
            "arabic_text": "وَوَجَدَكَ ضَآلًّا فَهَدَىٰ",
            "en_text": "Did He not find you unguided then guided you?"
        },
        {
            "verse_key": "93:8",
            "verse_num": "93:8",
            "arabic_text": "وَوَجَدَكَ عَآئِلًا فَأَغْنَىٰ",
            "en_text": "And did He not find you needy then satisfied your needs?"
        },
        {
            "verse_key": "93:9",
            "verse_num": "93:9",
            "arabic_text": "فَأَمَّا ٱلْيَتِيمَ فَلَا تَقْهَرْ",
            "en_text": "So do not oppress the orphan,"
        },
        {
            "verse_key": "93:10",
            "verse_num": "93:10",
            "arabic_text": "وَأَمَّا ٱلسَّآئِلَ فَلَا تَنْهَرْ",
            "en_text": "nor repulse the beggar.<sup foot_note=77625>1</sup>"
        },
        {
            "verse_key": "93:11",
            "verse_num": "93:11",
            "arabic_text": "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ",
            "en_text": "And proclaim the blessings of your Lord."
        }
    ]
}