{
    "audio": {
        "audio_files": [
            {
                "id": 1107,
                "chapter_id": 99,
                "file_size": 968832.0,
                "format": "mp3",
                "audio_url": "https://download.quranicaudio.com/qdc/mishari_al_afasy/murattal/99.mp3",
                "duration": 49000,
                "verse_timings": [
                    {
                        "verse_key": "99:1",
                        "timestamp_from": 0,
                        "timestamp_to": 4780,
                        "duration": 4780,
                        "segments": [
                            [
                                1,
                                0,
                                690
                            ],
                            [
                                2,
                                690,
                                1730
                            ],
                            [
                                3,
                                1730,
                                2580
                            ],
                            [
                                4,
                                2580,
                                4295
                            ]
                        ]
                    },
                    {
                        "verse_key": "99:2",
                        "timestamp_from": 4780,
                        "timestamp_to": 9270,
                        "duration": 4490,
                        "segments": [
                            [
                                1,
                                4295,
                                5675
                            ],
                            [
                                2,
                                5675,
                                6465
                            ],
                            [
                                3,
                                6465,
                                8160
                            ]
                        ]
                    },
                    {
                        "verse_key": "99:3",
                        "timestamp_from": 9270,
                        "timestamp_to": 14340,
                        "duration": 5070,
                        "segments": [
                            [
                                1,
                                8645,
                                9575
                            ],
                            [
                                2,
                                9575,
                                11955
                            ],
                            [
                                3,
                                11955,
                                12435
                            ],
                            [
                                4,
                                12435,
                                13140
                            ]
                        ]
                    },
                    {
                        "verse_key": "99:4",
                        "timestamp_from": 14340,
                        "timestamp_to": 19750,
                        "duration": 5410,
                        "segments": [
                            [
                                1,
                                13765,
                                15945
                            ],
                            [
                                2,
                                15945,
                                16985
                            ],
                            [
                                3,
                                16985,
                                18640
                            ]
                        ]
                    },
                    {
                        "verse_key": "99:5",
                        "timestamp_from": 19750,
                        "timestamp_to": 24610,
                        "duration": 4860,
                        "segments": [
                            [
                                1,
                                19215,
                                20965
                            ],
                            [
                                2,
                                20965,
                                21905
                            ],
                            [
                                3,
                                21905,
                                22775
                            ],
                            [
                                4,
                                22775,
                                23430
                            ]
                        ]
                    },
                    {
                        "verse_key": "99:6",
                        "timestamp_from": 24610,
                        "timestamp_to": 33280,
                        "duration": 8670,
                        "segments": [
                            [
                                1,
                                23965,
                                25975
                            ],
                            [
                                2,
                                25975,
                                26795
                            ],
                            [
                                3,
                                26795,
                                28425
                            ],
                            [
                                4,
                                28425,
                                29505
                            ],
                            [
                                5,
                                29505,
                                30525
                            ],
                            [
                                6,
                                30525,
                                32480
                            ]
                        ]
                    },
                    {
                        "verse_key": "99:7",
                        "timestamp_from": 33280,
                        "timestamp_to": 40390,
                        "duration": 7110,
                        "segments": [
                            [
                                1,
                                33125,
                                33705
                            ],
                            [
                                2,
                                33705,
                                35265
                            ],
                            [
                                3,
                                35265,
                                36375
                            ],
                            [
                                4,
                                36375,
                                37375
                            ],
                            [
                                5,
                                37375,
                                38175
                            ],
                            [
                                6,
                                38175,
                                40150
                            ]
                        ]
                    },
                    {
                        "verse_key": "99:8",
                        "timestamp_from": 40390,
                        "timestamp_to": 49920,
                        "duration": 9540,
                        "segments": [
                            [
                                1,
                                40305,
                                40855
                            ],
                            [
                                2,
                                40855,
                                42765
                            ],
                            [
                                3,
                                42765,
                                43945
                            ],
                            [
                                4,
                                43945,
                                45125
                            ],
                            [
                                5,
                                45125,
                                47095
                            ],
                            [
                                6,
                                47095,
                                49620
                            ]
                        ]
                    }
                ]
            }
        ]
    },
    "surah_info": {
        "surah_name": "Surah Az-Zalzalah",
        "ayah_count": "8",
        "revelation_place": "Medina",
        "description": "NameIt is derived from the word zilzal in the first verse.Period of RevelationWhether or not Surah Az-Zalzalah was revealed in Makkah or Madinah is disputed. Ibn Masud, Ata, Jabir, and Mjahid say that it is a Makki Surah and a statement of Ibn Abbas also supports this view. On the contrary, Qatadah and Muqatil say that it is Madani and another statement of Ibn Abbas also has been cited in support of this view. That it is a Madani Surah is reasoned from a tradition from Hadrat Abu Said Khudri, which Ibn Abi Hatim has related from him. He says: \"When the verse 'Fa-man ya mal mithqala dharratin khairan yarah, wa man ya mal mithqala dharratin sharran yarah', was revealed, I said: 'O Messenger of Allah, shall I really see my deeds?' The Holy Messenger replied in the affirmative. I submitted: 'And every major sin?' He replied 'yes.' I said: 'And the minor sins too?' He replied 'yes.' Thereupon I exclaimed that I would then be ruined. The Holy Prophet said: Rejoice, O Abu Sa'id, for each good act will be equal to ten good acts like it.\" The basis of the argument for this Surah being Madani is that Hadrat Abu Sa'ld Khudri was an inhabitant of Madinah and reached maturity after the Battle of Uhud. Therefore, if this Surah was revealed in his presence, as is apparent from his statement, it must be a Madani Surah. However, the practice that the Companions and their immediate successors followed in respect of the occasion of the revelation of the verses and Surahs, has already been explained in the Introduction to Surah Ad-Dahr above. Therefore, a Companion's saying that a verse was sent down on this or that particular occasion is no proof that it was sent down on that very occasion. It may well be that after coming of age, Hadrat Abu Sa'id heard this Surah for the first time from the Holy Prophet, terrified by its last portion, might have asked the Holy Prophet the questions which we have cited above, and he might have narrated the incident saying that when this verse was revealed he put this and this question to the Holy Prophet. In the absence of this tradition every reader who reads the Quran with understandings will feel that it is a Makki Surah. In addition, from its theme and style one would feel that it must have been sent down in the earliest stage at Makkah when the fundamental principles and beliefs of Islam were being presented before the people in a concise but highly effective manner.Theme and Subject MatterThe surah's theme is the second life after death and presentation in it before man of the full record of the deeds done by him in the world. In the first three sentences it has been told briefly how the second life after death will take place and how confounding it will be for man. In the next two sentences it has been said that this very earth on which man has lived and performed all kinds of deeds thoughtlessly, and about which he never could imagine that this lifeless thing would at some point in the future bear witness to his deeds, will speak out on that Day by Allah's command and will state in respect of each individual person, what act he had committed at a particular time and place. Then, it has been said that men on that Day, rising from their graves, will come out in their varied groups from all corners of the earth, to be shown their deeds and works, and their presentation of the deeds will be so complete and detailed that not an atom's weight of any good or evil act will be left unnoticed or hidden from his eyes."
    },
    "surah_verses": [
        {
            "verse_key": "99:1",
            "verse_num": "99:1",
            "arabic_text": " إِذَا زُلْزِلَتِ ٱلْأَرْضُ زِلْزَالَهَا",
            "en_text": "When the earth is shaken ˹in˺ its ultimate quaking,"
        },
        {
            "verse_key": "99:2",
            "verse_num": "99:2",
            "arabic_text": "وَأَخْرَجَتِ ٱلْأَرْضُ أَثْقَالَهَا",
            "en_text": "and when the earth throws out ˹all˺ its contents,<sup foot_note=77635>1</sup>"
        },
        {
            "verse_key": "99:3",
            "verse_num": "99:3",
            "arabic_text": "وَقَالَ ٱلْإِنسَـٰنُ مَا لَهَا",
            "en_text": "and humanity cries, “What is wrong with it?”—"
        },
        {
            "verse_key": "99:4",
            "verse_num": "99:4",
            "arabic_text": "يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا",
            "en_text": "on that Day the earth will recount everything,"
        },
        {
            "verse_key": "99:5",
            "verse_num": "99:5",
            "arabic_text": "بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا",
            "en_text": "having been inspired by your Lord ˹to do so˺."
        },
        {
            "verse_key": "99:6",
            "verse_num": "99:6",
            "arabic_text": "يَوْمَئِذٍ يَصْدُرُ ٱلنَّاسُ أَشْتَاتًا لِّيُرَوْا۟ أَعْمَـٰلَهُمْ",
            "en_text": "On that Day people will proceed in separate groups<sup foot_note=77636>1</sup> to be shown ˹the consequences of˺ their deeds."
        },
        {
            "verse_key": "99:7",
            "verse_num": "99:7",
            "arabic_text": "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُۥ",
            "en_text": "So whoever does an atom’s weight of good will see it."
        },
        {
            "verse_key": "99:8",
            "verse_num": "99:8",
            "arabic_text": "وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُۥ",
            "en_text": "And whoever does an atom’s weight of evil will see it."
        }
    ]
}